package data

/***
ascii table 	 - https://www.w3schools.com/charsets/ref_utf_cyrillic.asp
-----------------------------------------------------------------------------------------------------
RuUpperLeft 	 = левая граница русских символов алфавита в верхнем ресистре в таблице ascii
RuUpperRight 	 = правая граница русских символов алфавита в верхнем ресистре в таблице ascii
RuLowerLeft 	 = левая граница русских символов алфавита в нижнем регистре ресистре в таблице ascii
RuLowerRight 	 = правая граница русских символов алфавита в нижнем ресистре в таблице ascii
RuAlphabetLenght = длина русского алфавита 32 символа из за того что буква 'ё' не учитывается
-----------------------------------------------------------------------------------------------------
EnUpperLeft 	 = левая граница английских символов алфавита в верхнем ресистре в таблице ascii
EnUpperRight	 = правая граница английских символов алфавита в верхнем ресистре в таблице ascii
EnLowerLeft 	 = левая граница английских символов алфавита в нижнем ресистре в таблице ascii
EnLowerRight 	 = правая граница английских символов алфавита в нижнем ресистре в таблице ascii
EnAlphabetLenght = длина аглийского алфавита
***/

const (
	RuUpperLeft      = 1040
	RuUpperRight     = 1071
	RuLowerLeft      = 1072
	RuLowerRight     = 1103
	RuAlphabetLenght = 32
	EnUpperLeft      = 65
	EnUpperRight     = 90
	EnLowerLeft      = 97
	EnLowerRight     = 122
	EnAlphabetLenght = 26
)
